In [1]:
import pandas as pd
import seaborn as sns

Load Dataset :

In [ ]:
#Load the titanic dataset
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
#Load a time series dataset (taxis)
taxis = sns.load_dataset('taxis')
taxis.head()

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.60,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan
1,2019-03-04 16:11:55,2019-03-04 16:19:00,1,0.79,5.0,0.00,0.0,9.30,yellow,cash,Upper West Side South,Upper West Side South,Manhattan,Manhattan
2,2019-03-27 17:53:01,2019-03-27 18:00:25,1,1.37,7.5,2.36,0.0,14.16,yellow,credit card,Alphabet City,West Village,Manhattan,Manhattan
3,2019-03-10 01:23:59,2019-03-10 01:49:51,1,7.70,27.0,6.15,0.0,36.95,yellow,credit card,Hudson Sq,Yorkville West,Manhattan,Manhattan
4,2019-03-30 13:27:42,2019-03-30 13:37:14,3,2.16,9.0,1.10,0.0,13.40,yellow,credit card,Midtown East,Yorkville West,Manhattan,Manhattan

Initial Data Type Inspection :

In [5]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [7]:
taxis.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6433 entries, 0 to 6432
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   pickup           6433 non-null   datetime64[ns]
 1   dropoff          6433 non-null   datetime64[ns]
 2   passengers       6433 non-null   int64
 3   distance         6433 non-null   float64
 4   fare             6433 non-null   float64
 5   tip              6433 non-null   float64
 6   tolls            6433 non-null   float64
 7   total            6433 non-null   float64
 8   color            6433 non-null   object
 9   payment          6389 non-null   object
 10  pickup_zone      6407 non-null   object
 11  dropoff_zone     6388 non-null   object
 12  pickup_borough   6407 non-null   object
 13  dropoff_borough  6388 non-null   object
dtypes: datetime64[ns](2), float64(5), int64(1), object(6)
memory usage: 703.7+ KB

Verifying Numeric Columns :

In [8]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [9]:
df['age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

Checking Unique Values in Categorical Columns :

In [10]:
df['sex'].unique()

array(['male', 'female'], dtype=object)

In [11]:
df['embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [12]:
df['embarked'].value_counts()

embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [13]:
df['sex'].value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [14]:
#Standarize categories
df['sex'].str.lower()

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: sex, Length: 891, dtype: object

Verifing Data Columns :

In [15]:
taxis['pickup'].dtype

dtype('<M8[ns]')

In [16]:
taxis['pickup'].head()

0   2019-03-23 20:21:09
1   2019-03-04 16:11:55
2   2019-03-27 17:53:01
3   2019-03-10 01:23:59
4   2019-03-30 13:27:42
Name: pickup, dtype: datetime64[ns]

Using select_dtypes for Type-Based Selection :

In [17]:
df.select_dtypes(include=['category'])

      class deck
0     Third  NaN
1     First    C
2     Third  NaN
3     First    C
4     Third  NaN
..      ...  ...
886  Second  NaN
887   First    B
888   Third  NaN
889   First    C
890   Third  NaN

[891 rows x 2 columns]

Handling Mixed Data Types :

In [18]:
import numpy as np
df.loc[0, 'age'] = '30.5'
df.loc[2, 'age'] = np.nan

/var/folders/tq/zpj_p9256ql0ljgyb6kfdry00000gn/T/ipykernel_70510/1634665546.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '30.5' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.loc[0, 'age'] = '30.5'

In [19]:
#Detecting Mixed Types
def detect_mixed_types(df):
    mixed_types = {}
    for col in df.columns:
        types = df[col].apply(lambda v: type(v).__name__).value_counts()
        if len(types) > 1:
            mixed_types[col] = types.to_dict()
    return mixed_types

In [20]:
detect_mixed_types(df)

{'age': {'float': 890, 'str': 1},
 'embarked': {'str': 889, 'float': 2},
 'embark_town': {'str': 889, 'float': 2}}

In [21]:
#Handling Mixed Numeric and String Data
def clean_numeric_column(series):
    #convert to numeric, forcing errors to NaN
    numeric_series = pd.to_numeric(series, errors='coerce')

    #Check what percentage of data was losing 
    percent_lost = (series.dropna().size - numeric_series.dropna().size)/series.size

    print(f'Percentage of data lost: {percent_lost:.2%}')
    return numeric_series

In [22]:
clean_numeric_column(df['age'])

Percentage of data lost: 0.00%

0      30.5
1      38.0
2       NaN
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [23]:
#Handling mixed Categorical data
def clean_categorical_column(series, mapping):
    #Create a mapping for full names to abbreviations
    mapping = {'cherbourg': 'C', 'Queenstown': 'Q', 'southamptom': 'S'}

    #Appling mapping and convert to category
    clean_series = series.map(lambda x: mapping.get(x, x)).astype('category')

    print(f'Unique values: {clean_series.unique()}')
    return clean_series

In [24]:

#handling Mixed Boolean data
def clean_boolean_column(series):
    #Define values to be considered as True
    true_values = [True, 'True', 'true', 'YES', 'yes', 'Y', 'y', 1, 1.0]

    cleaned_series = series.isin(true_values)

    print(f'Unique values: {cleaned_series.unique()}')
    return cleaned_series

In [ ]:
#Handling mixed Date Types
%pip install dateparser
import dateparser

def convert_to_iso(date_string):
    #Parse the date string 
    parsed_date = dateparser.parse(date_string)

    if parsed_date is None:
        return 'Invalid date format'

    #Convert to ISO format
    iso_date = parsed_date.isoformat()

    return iso_date